# -*- coding: utf-8 -*-
# Copyright (c) huawei, Inc. and its affiliates.
"""Module providing CLEAN_RE_RULES."""


CLEAN_RE_RULES = {
    # 多余空格
    "multi_space": [r"  [ ]*"],
    # 空白字符
    "multi_blank_character": [r"[\u3000]+", r"[\ufeff]+", r"[\uf070]+", r"[\xa0]+"],
    # 疑似异常标点
    "abnormal_punctuation": [r"袁[^。]+?袁", r"鄄[^-]+?鄄"],
    # 多余标点符号
    "extra_punctuation": [r"[?!？！]{2,}", r"[，。？！,.?!]{2,}"],
    # 加粗文本（带**）;斜体文本（带*）
    "bold_italic_return": [
        r"(?<=[^\*\d])(\*\*[^\*]{2,}\*\*)(?=[^\*\d])",
        r"(?<=[^\*\d])(\*[^\*]+?\*)(?=[^\*\d])",
    ],
    # 单元格内换行（<br>）  单元格内换行（\n\t）
    "cell_br": [
        r"(?<=\|)(<br>[\s\S]+?(<br>)?)(?=\|)",
        r"(?<=\|)([\n\t]+?[\s\S]+?[\n\t]*?)(?=\|)",
    ],
    # 修订记录
    "revision_history": [
        r"修订历史",
        r"修订版本",
        r"修改记录",
        r"修订记录",
        r"(?<=\n)修改记录(?=\n)",
        r"(?<=\n)修订记录(?=\n)",
        r"修订者",
    ],
    # 叠字文本
    "italicized_text": [
        r"((([\u4e00-\u9fa5])\3\3?\3?\3?\3?)(([\u4e00-\u9fa5])\5\5?\5?\5?\5?)"
        r"(([\u4e00-\u9fa5])\7\7?\7?\7?\7?)?(([\u4e00-\u9fa5])\9\9?\9?\9?\9?)?"
        r"(([\u4e00-\u9fa5])\11\11?\11?\11?\11?)?(([\u4e00-\u9fa5])\13\13?\13?\13?\13?)?)"
    ],
    # 疑似乱码
    "garbled_characters": [
        r"[�]+",
        r"[牐瘛裰狊犻狅犌犪犮犽犎狉犾狑犔]{2,}",
        r"淼淖酆峡疾煊敕治觥{2,}",
        r"酆显擞们懊嫜{2,}",
    ],
    # 如图
    "fig": [
        # 有明显特征
        r"[(（]+如[上下]?图表?\s*((\d+(?:[-.]\d+)*)|[a-zA-Z])+所示的?[)）]+",
        r"[(（]+如图表?\s*((\d+(?:[-.]\d+)*)|[a-zA-Z])+[ ]*[左右][)）]+",
        r"[(（]+如图表所示[)）]+",
        r"[(（]+[详参]见图[)）]+",
        r"[(（]+[如见]?[上下]?图\s*((\d+(?:[-.]\d+)*)|[a-zA-Z])+[)）]+",
        r"[(（]+见图表.*?[)）]+",
        r"[(（]+见图表(\d+(?:[-.]\d+))?[)）]+",
        r"[(（]+[如见]图[)）]+",
        r"[(（].*?图\d+([.-]\d+)*?.*?[)）]",
        r"(?<=\n)(图[ ]*((\d+(?:[-.]\d+)*)|[a-zA-Z])+[ ]*[^,.，。：:;；]*?)(?=\n)",
        # 删除无上下文关联的半句
        r"([,，。]+[看以]?"
        r"[详参]?[见如]?在?(根据)?[上下]?图表?\s*((\d+([.-]\d+[a-zA-Z]?)*)|[a-zA-Z])?\s*中?(所示)?的?(为例)?)(?=[,，。:：])",
        r"(?<=\n)([看以]?"
        r"[见如]?在?(根据)?[上下]?(图表?\s*((\d+([.-]\d+[a-zA-Z]?)*)|[a-zA-Z])?和?)+\s*中?(所示)?的?(为例)?[，,。：:])",
        r"(?<=\b)([看以]?"
        r"[见如]?在?(根据)?[上下]?(图表?\s*((\d+([.-]\d+[a-zA-Z]?)*)|[a-zA-Z])?和?)+\s*中?(所示)?的?(为例)?[，,。：:])",
    ],
    # 参考文献
    "references": [
        r"\n参考文献[ :：]*?[\s?]*?([\d]|［\d］|《|\d|\w)+[^。]*",
        r"\n参考文献[ （(]*?(部分|References)[)） ]*?[:：]?[\s\n]*(\[\d]|《|\d|\w)+[^。]*",
        r"\n参考文献[:：]?[\s?]?[\n]+[^。]*",
        r"\n主要参考文献[:：]?[\s?]?[\n]+[^。]*",
        r"\n参考文献[^。]*",
        r"\n 参 考 文 献\n[^。]*",
    ],
    # 邮箱
    "email": [
        r"((?<=Email)"
        r"[：:\s]*[a-zA-Z_\d]+([-+.][a-zA-Z_\d]+)*@[a-zA-Z_\d]+([-.][a-zA-Z_\d]+)*\.[a-zA-Z]+）?)",
        r"((?<=邮件|邮箱|联系|信箱)"
        r"[：:\s]*[a-zA-Z_\d]+([-+.][a-zA-Z_\d]+)*@[a-zA-Z_\d]+([-.][a-zA-Z_\d]+)*\.[a-zA-Z]+）?)",
        r"((?<=邮件[\u4e00-\u9fa5])"
        r"[：:\s]*[a-zA-Z_\d]+([-+.][a-zA-Z_\d]+)*@[a-zA-Z_\d]+([-.][a-zA-Z_\d]+)*\.[a-zA-Z]+）?)",
        r"((?<=联系方式)"
        r"[：:\s]*[a-zA-Z_\d]+([-+.][a-zA-Z_\d]+)*@[a-zA-Z_\d]+([-.][a-zA-Z_\d]+)*\.[a-zA-Z]+）?)",
        r"((?<=E-mail|电子邮件地址)"
        r"[：:\s]*[a-zA-Z_\d]+([-+.][a-zA-Z_\d]+)*@[a-zA-Z_\d]+([-.][a-zA-Z_\d]+)*\.[a-zA-Z]+）?)",
        r"[:：]?[\u4e00-\u9fa5]*[a-zA-Z_\d]+([-+.][a-zA-Z_\d]+)*@[a-zA-Z_\d]+([-.][a-zA-Z_\d]+)*\.[a-zA-Z]+",
    ],
    # 手机号
    "phone_number": [
        r"(?<=客户服务电话)([:：\s\n]*?\d{10}(?!\d))+",
        r"(?<=联通|电信|移动)[:：\s\n]*?(106\d{7}(?!\d))+",
        r"(?<=短信号码)[:：\s\n]*?(106\d{7}(?!\d))+",
        r"(?<=短信发送到)[:：\s\n]*?(106\d{7}(?!\d))+",
        # 联系人:18XXXX（同微信）
        r"(?<=联系人)[ :：\s(（“、，；+\n]*?([\u4e00-\u9fa5]{2,3})?(((\+\d+)?\s?1[3-9]\d{9})[ ]?[(（]同微信[)）])",
        # ()中是3-5位区号的电话号码，如：电话：（0XX）88XXXX，(86XXX)88XXXX
        r"(?<=电话|热线|传真|拨打|座机|商家|公司|致电|咨询)([ :：\s(（“、，；和+\n]*?[(（]\d{3,5}[）)]\d{8}(?!\d))+",
        # [商家电话]：07XX-83XXX ；13XXXX
        r"(?<=电话])([ :：\s\n(（“/，；、和]*?(((\d{3,4}-)?\d{8})|((\+\d+)?\s?1[3-9]\d{9}))(?!\d)[ )）”]?)+",
        # 11位手机号码或座机号 电话后面直接是电话号码，如：劳XX电话：17XXXX 或咨询热线：0XX-57XXX/18XXXX
        r"(?<=联系方式)([ :：(（“/，；,、和+\n]*?(((\d{3,4}-)?\d{8})|((\+\d+)?\s?1[3-9]\d{9}))(?!\d)[ )）”]?)+",
        r"(?<=Mobile|mobile)([ :：(（“/，；,、和+\n]*?(((\d{3,4}-)?\d{8})|((\+\d+)?\s?1[3-9]\d{9}))(?!\d)[ )）”]?)+",
        r"(?<=Phone|phone)([ :：(（“/，；,、和+\n]*?(((\d{3,4}-)?\d{8})|((\+\d+)?\s?1[3-9]\d{9}))(?!\d)[ )）”]?)+",
        r"(?<=号码（MSISDN）为)([ :：(（“/，；,、和+\n]*?(((\d{3,4}-)?\d{8})|((\+\d+)?\s?1[3-9]\d{9}))(?!\d)[ )）”]?)+",
        r"(?<=拨打|电话|手机|微信|号码|热线|咨询|卡号|短信|扫码|发送|账户|号为"
        r"|助理|经理|秘书|书记|主任|部长|来电|你打|座机|商家|公司|致电)"
        r"([ :：(（“/，；,、和+\n]*?(((\d{3,4}-)?\d{8})|((\+\d+)?\s?1[3-9]\d{9}))(?!\d)[ )）”]?)+",
        r"(?<=微信号|手机号|号码为|号码是|TEL|Tel|办事处|内容至|接入号|转接到|号 码)"
        r"([ :：(（“/，；,、和+\n]*?(((\d{3,4}-)?\d{8})|((\+\d+)?\s?1[3-9]\d{9}))(?!\d)[ )）”]?)+",
        # 展览会联系方式：李XX，0XX-66XX,13XXX
        r"(?<=联系人|联络人|接口人|负责人|请咨询)[ :：(（“/，；,、+和\n]*?([\u4e00-\u9fa5]{2,3}|[ a-zA-Z]{4,})"
        r"([(（:：，/；,、和]?(((\d{3,4}-)?\d{8})|((\+\d+)?\s?1[3-9]\d{9}))(?!\d)[ )）”]?)+",
        r"(?<=作者|联系|领导|致电)[ :：(（“/，；,、+和\n]*?([\u4e00-\u9fa5]{2,3}|[ a-zA-Z]{4,})"
        r"([(（:：，/；,、和]?(((\d{3,4}-)?\d{8})|((\+\d+)?\s?1[3-9]\d{9}))(?!\d)[ )）”]?)+",
        r"(?<=技术支持|联系方式|咨询专线)[ :：(（“/，；,、+和\n]*?([\u4e00-\u9fa5]{2,3}|[ a-zA-Z]{4,})"
        r"([(（:：，/；,、和]?(((\d{3,4}-)?\d{8})|((\+\d+)?\s?1[3-9]\d{9}))(?!\d)[ )）”]?)+",
        # 请咨询：\n陈先生 13XXX\n朱女士 13XXX
        r"(?<=联系人|联络人|接口人|负责人|请咨询)([ :：(（“/，；,、+和\n]*?([\u4e00-\u9fa5]{2,3}"
        r"|[ a-zA-Z]{4,})[:：]?(((\d{3,4}-)?\d{8})|((\+\d+)?\s?1[3-9]\d{9}))(?!\d)[ )）”]?)+",
        r"(?<=作者|联系|致电)([ :：(（“/，；,、+和\n]*?([\u4e00-\u9fa5]{2,3}"
        r"|[ a-zA-Z]{4,})[:：]?(((\d{3,4}-)?\d{8})|((\+\d+)?\s?1[3-9]\d{9}))(?!\d)[ )）”]?)+",
        r"(?<=技术支持|联系方式|咨询专线)([ :：(（“/，；,、+和\n]*?([\u4e00-\u9fa5]{2,3}"
        r"|[ a-zA-Z]{4,})[:：]?(((\d{3,4}-)?\d{8})|((\+\d+)?\s?1[3-9]\d{9}))(?!\d)[ )）”]?)+",
    ],
    # 超链接
    "hyper_link": [
        r"((网址)?[:：\s]*(https?|ftp|file)://[-A-Za-z0-9+&@#/%?=~_|!:,.;]+[-A-Za-z0-9+&@#/%=~_|])"
    ],
    # 版权信息
    "copyright_information": [
        r"x.com©\d{4}年泰克公司版权所有，侵权必究。?",
        r"华为技术有限公司[\s\S]+?华为技术有限公司©\d{4}",
        r"华为技术有限公司©\d{4}",
        r"版权所有[\s\S]+不得仿冒。?",
        r"版权所有，侵权必究。?",
        r"版权所有.*?保留一切权利。?",
        r"版权所有.*?不构成任何形式的承诺。?",
        r"版权所有.*?华为技术有限公司[ ]?\d{4}?。?",
        r"如需转载，请注明出处，否则将追究法律责任。?",
        r"非经本公司书面许可，任何单位和个人不得擅自摘抄、复制本书内容的部分或全部，并不得以任何形式传播。?",
        r"版权所有[\s\S]+?不得以任何形式重制。?",
        r"华为技术有限公司",
        r"All rights reserved",
        r"Huawei Technologies Co., Ltd.",
        r"未经许可[\s\S]+?内容。?",
    ],
    # w3姓名工号
    "job_number": [
        r"作者[|:：\s(（]*([\u4e00-\u9fa5]{2,3}|[a-zA-Z]{4,}|employee ID:)[ ]+[a-zA-Z]"
        r"?((00|30|84)[1-9]\d{5}|\w?(wx|WX)\d{6,7}|\w?(kf|KF)\d{6})[)）]?",
        r"工号[|:：\s(（]*((00|30|84)[1-9]\d{5}|\w?(wx|WX)\d{6,7}|\w?(kf|KF)\d{6})[)）]?",
        r"(接口人|联系人)[|:：\s(（]*([\u4e00-\u9fa5]{2,3}|[a-zA-Z]{4,}|employee ID:)[ ]+[a-zA-Z]?"
        r"((00|30|84)[1-9]\d{5}|\w?(wx|WX)\d{6,7}|\w?(kf|KF)\d{6})[)）]?",
        r"(([\u4e00-\u9fa5]{2,3}|[a-zA-Z]{4,}|employee ID:)[ ]+[a-zA-Z]?"
        r"((00|84|83|82|81|80|60|90)[1-9]\d{5}|(300|500)\d{5}|(wx|WX|hz|HZ|wy|WY|hc|HC|gw|GW|kf|KF)\d{5,7}))(?!\d)",
    ],
    # 结尾标识
    "end_str": [r"[-]{2,}[ ]?结束", "r[-]{2,}[ ]?end", "r[-]{2,}[ ]?End"],
    # QQ号
    "qq_number": [r"(?<=qq|QQ|\+q|\+Q|加q|加Q|q号|Q号)[ :：]*?([1-9][0-9]{5,10})(?!\d)"],
    "multi_br": [r"(<br>[ ]*){2,}"],
    # 单个按钮文本
    "single_btn": [
        r"^((历史)|(版本)|(记录))?修(订|改)((历史)|(版本)|(记录)|(者))?$",
        r"(^登录\/注册$)|(^登录$)|(^注册$)|(^首页$)|(^导航$)|(^反馈$)|(^关于我们$)|(^预览时标签不可点$)",
        r"(^微信$)|(^微信号$)|(^继续滑动看下一个$)|(^轻触阅读原文$)|(^知道了$)|(^扫一扫$)|(^关于我们$)|(^订阅专栏$)",
        r"(^关注$)|(^关注该公众号$)|(^微信扫一扫关注该公众号$)|(^微信扫一扫使用小程序$)",
        r"(^确定取消$)|(^确定$)|(^取消$)|(^确定不再关注此人吗$)|(^允许$)|(^视频$)|(^小程序$)",
        r"(^踩$)|(^赞$)|(^点赞$)|(^点赞数$)|(^轻点两下取消赞$)|(^喜欢$)|(^收藏$)|(^申请转载$)|(^粉丝$)|(^目录$)|(^收起$)",
        r"(^在看$)|(^轻点两下取消在看$)|(^分享$)|(^留言$)|(^直播$)|(^美图$)|(^博客$)|(^政务$)|(^搞笑$)|(^八卦$)|(^情感$)|(^旅游$)",
        r"(^看点$)|(^沸点$)|(^社会$)|(^众测$)|(^佛学$)|(^新浪$)|(^新浪网$)|(^新浪新闻$)|(^加载中$)|(^加载中...$)",
        r"(^课程$)|(^活动$)|(^竞赛$)|(^商城$)|(^APP$)|(^插件$)|(^搜索历史$)|(^清空$)|(^创作者中心$)|(^会员$)|(^查看更多$)",
        r"(^最新文章$)|(^热门文章$)|(^最新$)|(^热门$)|(^文章$)|(^推荐阅读$)|(^阅读$)|(^推荐$)|(^关注博主即可阅读全文$)",
        r"(^最新发布$)|(^提交$)|(^威赞$)|(^觉得还不错?$)|(^您还未登录，请先$)|(^后发表或查看评论$)|(^复制链接$)|(^下一步$)",
        r"(^最新评论$)|(^一键收藏$)|(^收藏$)|(^打赏$)|(^评论$)|(^参与评论$)|(^查看更多评论$)|(^专栏目录$)|(^原创$)",
        r"(^非常没帮助$)|(^没帮助$)|(^一般$)|(^一般般$)|(^有帮助$)|(^非常有帮助$)|(^强烈不推荐$)|(^强烈推荐$)|(^不推荐$)",
        r"(^CSDN认证博客专家$)|(^CSDN认证企业博客$)|(^暂无认证$)|(^认证$)|(^暂无$)|(^周排名$)|(^总排名$)|(^访问$)|(^等级$)",
        r"(^积分$)|(^获赞$)|(^私信$)|(^分类专栏$)|(^添加红包$)|(^祝福语$)|(^请填写红包祝福语或标题$)|(^红包数量$)|(^个$)|(^元$)",
        r"(^钱包余额$)|(^余额$)|(^余额充值$)|(^余额支付$)|(^使用余额支付$)|(^前往充值$)|(^充值$)|(^打赏作者$)|(^扫码支付$)",
        r"(^实付元$)|(^获取中$)|(^红包金额$)|(^红包总金额$)|(^优惠劵$)|(^您的余额不足，请更换扫码支付或充值$)|(^点击重新获取$)",
        r"(^为什么被折叠?$)|(^你的鼓励将是我创作的最大动力$)|(^领取后你会自动成为博主和红包主的粉丝$)|(^成就一亿技术人!$)",
        r"(^扫码支付：)|(^需支付：)|(^抵扣说明：)|(^红包金额)|(^当前余额)",
        r"发出的红包$",
    ],
}
